modm-ext/data.modm.io/docs/svd/header_stm32g041xx.svd
        <register>
          <name>ITLINE21_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIM16_GLB</name>
              <description>TIM16 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE22_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIM17_GLB</name>
              <description>TIM17 GLB Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE23_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C1_GLB</name>
              <description>I2C1 GLB Interrupt -&gt; exti[23]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE24_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C2_GLB</name>
              <description>I2C2 GLB Interrupt -&gt; exti[22]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE25_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI1</name>
              <description>SPI1 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE26_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI2</name>
              <description>SPI2 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE27_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART1_GLB</name>
              <description>USART1 GLB Interrupt -&gt; exti[25]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE28_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USART2_GLB</name>
              <description>USART2 GLB Interrupt -&gt; exti[26]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE29_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LPUART1_GLB</name>
              <description>LPUART1 GLB Interrupt -&gt; exti[28]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IT_LINE_SR29</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVDOUT</name>
              <description>Power voltage detection -&gt; exti[16] Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITLINE31_SR</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RNG</name>
              <description>RNG Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES</name>
              <description>AES Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IT_LINE_SR31</name>
          <description>SYSCFG configuration IT_LINE register</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVDOUT</name>
              <description>Power voltage detection -&gt; exti[16] Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
